In [1]:
import numpy as np
import pandas as pd

In [2]:
dict={'Name':['Nikita','Sneha','Riya','Mansi'],
       'Marks':[90,80,70,85],
       'city': ['Faridabad','Delhi','Mumbai','Kolkata']
     }

In [3]:
df=pd.DataFrame(dict)

In [4]:
df.to_csv('friends.csv')

In [5]:
df.head(3)

     Name  Marks       city
0  Nikita     90  Faridabad
1   Sneha     80      Delhi
2    Riya     70     Mumbai

In [6]:
df.describe()

           Marks
count   4.000000
mean   81.250000
std     8.539126
min    70.000000
25%    77.500000
50%    82.500000
75%    86.250000
max    90.000000